/* Status text for queued multi-part archives */
"%@ (+%d more)" = "%1$@ (+%2$d ponad)";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the file \"%@\" from the archive \"%@\": %@" = "Nie można rozpakować „%1$@” z archiwum „%2$@”: %3$@";

/* Error message string. The first %@ is the file name, the second the archive name, the third is error message */
"Could not extract the resource fork for the file \"%@\" from the archive \"%@\":\n%@" = "Nie można rozpakować rozwidlonych zasobów dla pliku „%1$@” z archiwum „%2$@”:\n%3$@";

/* Option in the password encoding pop-up to use the default encoding */
"Default encoding" = "Kodowanie domyślne";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Wykryj automatycznie";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Rozpakuj";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Rozpakuj archiwum";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Rozpakowanie „%@”";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Przygotowuję rozpakowanie „%@”";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Wybierz";

/* Panel title when choosing archives to extract */
"Select files to unarchive" = "Wybierz pliki do wypakowania";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "The Unarchiver nie może rozpakować zawartości „%@”.";

/* Error message when encountering an error while extracting entries */
"There was a problem while extracting the contents of the file \"%@\": %@" = "Wystąpił problem podczas rozpakowywania zawartości pliku „%1$@”: %2$@";

/* Error message when encountering an error while parsing an archive */
"There was a problem while reading the contents of the file \"%@\": %@" = "Wystąpił problem podczas odczytywania zawartości pliku „%1$@”: %2$@";

/* Panel OK button title when choosing archives to extract */
"Unarchive" = "Wypakuj";

/* Status text when asking for a password */
"You need to supply a password to open the archive \"%@\"." = "Podaj hasło, aby otworzyć archiwum „%@”.";

/* Title for nagging alert on first startup */
"Where should The Unarchiver extract archives?" = "Gdzie The Unarchiver ma rozpakować archiwa?";

/* Content of nagging alert on first startup */
"Would you like The Unarchiver to extract archives to the same folder as the archive file, or would you prefer to be asked for a destination folder for every individual archive?" = "Zawsze rozpakowuj do tego samego folderu, lub pytaj folder docelowy za każdym razem.";

/* Button to ask every time in nagging alert on first startup */
"Ask every time" = "Pytaj za każdym razem";

/* Button to extract to the same folder in nagging alert on first startup */
"Extract to the same folder" = "Rozpakuj do tego samego folderu";

/* Informative text in the file panel shown when trying to gain sandbox access */
"The Unarchiver does not have permission to write to this folder. To allow The Unarchiver to write to this folder, simply click \"Extract\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver potrzebuje zezwolenia na zapisanie rozpakowanych plików w wybranym folderze. Kliknij w „Rozpakuj”, aby potwierdzić tę czynność.";

/* Informative text in the file panel shown when trying to gain sandbox access for multi-part archives */
"The Unarchiver needs to search for more parts of this archive, but does not have permission to read the folder. To allow The Unarchiver to search in this folder, simply click \"Search\". This permission will be remembered for this folder, and The Unarchiver will not need to ask for it again." = "The Unarchiver potrzebuje zezwolenia na wyszukiwanie innych części wybranego archiwum w tej lokalizacji. Kliknij w „Wyszukaj”, aby potwierdzić tę czynność.";

/* Panel OK button title when searching for more archive parts */
"Search" = "Wyszukaj";

/* Check for updates menu item */
"Check for Updates…" = "Sprawdź aktualizacje…";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */
/* Common errors */

"Attempted to read more data than was available" = "Plik archiwum jest niekompletny";
"Opening file failed" = "Plik nie może zostać otwarty";
"Missing or wrong password" = "Podane hasło jest nieprawidłowe";
"Wrong checksum" = "Plik archiwum jest uszkodzony";
"Could not create directory" = "Nie można utworzyć folderu";

/* Uncommon or unused errors */
"Unknown error" = "Nieznany błąd";
"Failed to write to file" = "Zapis do pliku nie powiódł się";
"Function called with illegal parameters" = "Funkcja wywołana z nieprawidłowymi parametrami";
"Not enough memory available" = "Za mało dostępnej pamięci";
"Data is corrupted" = "Dane uszkodzone";
"File is not fully supported" = "Plik nie jest w pełni obsługiwany";
"Required resource missing" = "Brak wymaganych zasobów";
"Error on decrunching" = "Błąd podczas decrunching";
"Unknown file type" = "Nieznany typ pliku";
"File, disk has been skipped" = "Plik, dysk został pominięty";
"User cancelled extraction" = "Użytkownik przerwał rozpakowywanie";
"File already exists" = "Plik już istnieje";
"Verify failed (disk hook)" = "Niepowodzenie weryfikacji (disk hook)";
"Wrong drive geometry" = "Zła geometria dysku";
"Unknown data format" = "Nieznany format danych";
"Source contains no files" = "Źródło nie zawiera żadnych plików";
"Unknown filesystem" = "Nieznany system plików";
"Name of file exists as directory" = "Nazwa pliku istnieje jako katalog";
"Buffer was too short" = "Bufor jest za mały";
"Text encoding was defective" = "Naruszone kodowanie tekstu";
"Could not create symlink" = "Nie można utworzyć dowiązania";

"AlertTitle_SetFileTypeAssociationAppStore" = "Możesz ustawić The Unarchiver jako aplikację domyślną dla wybranych typów plików.";
"AlertDescription_SetFileTypeAssociationAppStore" = "Kliknij w „Informacje\" w menu kontekstowego pliku i wybierz The Unarchiver z listy „Otwórz w aplikacji:”. Kliknij w „Zmień wszystkie...”, aby zastosować wybór do wszystkich podobnych plików.";

"AlertTitle_UnsetFileTypeAssociationAppStore" = "Ustaw inną aplikację jako domyślną aplikację dla wybranych typów plików.";
"AlertDescription_UnsetFileTypeAssociationAppStore" = "Kliknij w „Informacje\" w menu kontekstowego pliku i wybierz żądaną aplikację z listy „Otwórz w aplikacji:”. Kliknij w „Zmień wszystkie...”, aby zastosować wybór do wszystkich podobnych plików.";

/* About window */
"Standalone" = "Niezależny";

/* Extracted view */
"extracted" = "rozpakowane";
